{
    "intents": [
      {
        "tag": "Mental-Health",
        "patterns":[
                    "I don't feel anything",
                    "I can't feel joy anymore",
                    "I am not getting joy",
                    "I feel empty",
                    "I have no motivation",
                    "I don't have any energy to do anything",
                    "I find it hard to concentrate on anything",
                    "I can never focus on my work",
                    "I procrastinate all the time and cannot help it",
                    "I feel like a failure in life",
                    "I don't see the point in living",
                    "I don't see the point in being alive",
                    "I want to die",
                    "I feel like dying",
                    "I want to kill myself",
                    "I am worried all the time",
                    "I get anxious over everything",
                    "I get worried for small things",
                    "I always feel sad",
                    "I feel unhappy",
                    "I want to feel happier",
                    "I want to worry less",
                    "I want to feel more calm"
                  ], 
        "responses": ["mental health intent"],
        "followup":["Do you go outside as soon as you wake up each day?",
                    "How long do you meditate for each day?",
                    "Do you write about how you can improve for the next day daily?",
                    "Do you write about 3 or more things you are grateful for daily?",
                    "How long do you read for on a daily basis?",
                    "Do you drink 2 litres of water a day?",
                    "Do you feel full after eating your meals?",
                    "How many meals do you eat in a day?",
                    "Do you eat healthy food daily? specify foods if unsure?",
                    "How long do you spend outside each day?",
                    "How long do you exercise for each day?",
                    "Do you hang out with friends on a weekly basis?",
                    "Do you spend little time on social media?",
                    "Do you avoid watching or looking at explicit content?",
                    "Do you take ZMA supplements at night daily?"
                  ]
      },
      {
        "tag": "Appearance",
        "patterns":["I want to be good looking",
                    "I want to be the best looking",
                    "I want to be more attractive",
                    "I want to improve my appearance but I don't know how?",
                    "I want to be as good looking as possible",
                    "I feel ugly",
                    "I look ugly",
                    "I don't like how I look",
                    "I don't like my appearance",
                    "I don't like the way I look",
                    "I hate the way I look"
                  ],
        "responses":["appearance intent"],
        "followup":["Do you trim facial hair on a weekly basis? if so what length do you trim at?",
                    "Do you ensure your neck is clean shaven?",
                    "Do you ensure a clear neck boundary on a weekly basis?",
                    "Do you pluck your monobrow on a weekly basis if you have one?",
                    "Do you pluck nose hair on a weekly basis?",
                    "Do you get monthly haircuts or trim own hair on a weekly basis?",
                    "Do you have a good skincare routine? What kind of skincare products do you currently use?",
                    "Do you go to the gym often, If so how many days of the week?",
                    "Do you accessorize clothing properly? Describe it if unsure?"
                  ]
      },
      {
        "tag":"Hygiene",
        "patterns":["I feel like people are repulsed by me",
                    "I think people find me disgusting",
                    "people never ask to hangout",
                    "people always avoid eye contact with me",
                    "people cover their mouth a lot when talking to me",
                    "no one wants to talk to me",
                    "people never invite me to anything",
                    "people always keep a distance away from me",
                    "I always get made fun of for bad breath",
                    "My breath always stinks",
                    "I want to make a better impression on people",
                    "I want to be more clean"
                    ],
        "responses":["Hygiene intent"],
        "followup":["How often do you brush your teeth?",
                    "Do you floss every day?",
                    "Do you scrape your tongue every day?",
                    "Do you use mouth wash every day?",
                    "Do you wash your hands on a regular basis?",
                    "Do you shower with soap on a daily basis?",
                    "Do you apply a good scent on a daily basis?",
                    "Do you cut finger and toe nails on a weekly basis?",
                    "Do you shave pubic hair on a weekly basis?",
                    "Do you shave armpit hair on a weekly basis?",
                    "Do you wash all your clothes on a weekly basis?"
        ]
      },
      {
        "tag":"Personality",
        "patterns":["people don't like me",
                    "no one likes me",
                    "people make fun of me",
                    "I always get ignored when I say stuff",
                    "people ignore me",
                    "I feel like I am invisible to people",
                    "even though I am nice to people, they are mean to me",
                    "why are people mean to me even though I am nice to them",
                    "everyone thinks I am annoying",
                    "I get manipulated all the time",
                    "I get played by others all the time",
                    "I want to be more likeable",
                    "I want to avoid getting played by others",
                    "I want to be more confident",
                    "I want to be more interesting to others",
                    "I want to have a more interesting personality",
                    "I want to have a better personality"
        ],
        "responses":["Personality intent"],
        "followup":["Would you consider yourself a confident person?",
                    "Would others say you have a good appearance?",
                    "Do you maintain eye contact when you talk to people?",
                    "Do you have slow movements and gestures?",
                    "Do you smile when talking to people?",
                    "Do you speak slow enough just for clarity and with a deep voice?",
                    "Do you care little about what people think about you?",
                    "Do you have a neutral/calm tone when you speak?",
                    "Do you listen effectively in comparison to talking?",
                    "Do people laugh when or if you attempt to make jokes?",
                    "Are you good at identifying when someone says a joke?",
                    "Are you good at not taking jokes seriously?",
                    "Would you consider yourself as a relatable person?",
                    "Do you openly give compliments to others?",
                    "Are you (cut throat/a bold person/stand up for yourself) when you need to be?"
                    ]
      },
      {
        "tag":"Purpose",
        "patterns":["I feel like everything I do is pointless",
                    "I feel like things I do are meaningless",
                    "I feel like there is no meaning in anything I do",
                    "I'm starting to question the purpose of my actions",
                    "I can't help but feel like my efforts are in vain",
                    "I'm struggling to find meaning in the things I do",
                    "It seems like nothing I do really matters",
                    "I'm finding it hard to see the value or impact of my actions",
                    "I feel like I'm just going through the motions without any purpose",
                    "I'm feeling disconnected and disillusioned with everything I engage in",
                    "I want more meaning in life",
                    "I want to achieve a greater purpose in life",
                    "I want to help others but I don't know how",
                    "I feel like I can achieve more but don't know how",
                    "I feel like I can be more impactful to the world but I don't know how"
                   ],
        "responses":["Purpose intent"],
        "followup":["Do you work on learning skills which have monetary value?",
                    "Do you regularly do Hobbies you enjoy without needing to monetize it?",
                    "Do you have an occupation e.g. a job or business you enjoy?",
                    "Do you have hobbies involving helping others?"]
        
      },
      {
        "tag":"Skin",
        "patterns":["I'm really self conscious about my skin",
                    "I feel so insecure about the way my face looks",
                    "I'm constantly worried about my skin's imperfections",
                    "I'm afraid people will judge me because of my skin",
                    "I struggle with low self-esteem because of my face",
                    "I feel ashamed of my skins appearance",
                    "I always compare myself to others and feel inferior because of my skin",
                    "I'm embarrassed by the blemishes on my skin.",
                    "I try to hide my skin issues because I feel so insecure about them",
                    "I get insecure about my pimples all the time",
                    "spots on my face make me feel bad",
                    "I want to have a shiny looking face",
                    "I want to get clear skin",
                    "I want a nice looking face",
                    "I want nice skin"
                    ],
        "responses":["Skin intent"],
        "followup":["Do you ensure your face is only washed with cold water?",
                    "Do you ensure you use a cleanser every day?",
                    "Do you use moisturiser every day and night?",
                    "Do you layer moisturiser with sunscreen every day?",
                    "Do you use retinol every night with at least a 2 days gap?",
                    "Do you exfoliate your skin once a week?"]
      },
      {
        "tag":"Fashion",
        "patterns":["I want to dress better",
                    "I want to look cooler",
                    "I want to look cool",
                    "I want to improve my fashion",
                    "I want to look more trendy",
                    "I want to stand out a bit more",
                    "I try to get better style",
                    "I want to improve my style",
                    "I want to be more stylish",
                    "I want to look like I have more style",
                    "I want to upgrade my wardrobe and improve my personal style",
                    "I'm looking to enhance my fashion sense and dress more stylishly",
                    "I feel like it's time for a wardrobe makeover to improve my overall look",
                    "I want to step up my fashion game and dress more confidently",
                    "I'm interested in refining my clothing choices and dressing more professionally",
                    "I'm seeking advice on how to dress better and make a better impression",
                    "I want to experiment with different styles and find what suits me best",
                    "I'm open to learning about fashion tips and trends to help me dress better"],
        "responses":["Fashion intent"],
        "followup":["Do you always layer clothing? e.g. with Flannels,coats or varsity jackets?",
                    "Do you wear jewlerry? e.g. chains, rings and watches?",
                    "Are clothes you wear non-branded?",
                    "Do clothes you wear have little to no designs on them?",
                    "Do you cuff jeans when you wear them?",
                    "Do you wear clean shoes?"]
      },
      {
        "tag":"Intelligence",
        "patterns":["I don't feel like I am that smart compared to other people",
                    "I wish I was smarter",
                    "I feel stupid compared to others",
                    "I try hard but still do badly compared to people",
                    "I try really hard but I wish I was more intelligent as well",
                    "I still do badly in stuff even though I do my best",
                    "even though I try my best, I still don't get what I want",
                    "I feel dumb all the time",
                    "I do dumb things all the time",
                    "I feel like I do stupid things all the time",
                    "I don't understand why I do dumb things all the time",
                    "I want to be more effective",
                    "I want to be more witty",
                    "I want to be smarter",
                    "I want to be more intellectual"],
        "responses":["Intelligence Intent"],
        "followup":["Are you mindful of your own improvement or self development?",
                    "Do you keep your cool in seemingly stressful situations?",
                    "If you are a student, Do you use active study techniques e.g. flashcards ensuring you've taken information from a textbook?",
                    "If you are a student, Do you implement spaced repetition in your learning to understand information(learning the same info the next hour then day then week then month etc.)?"]
      },
      {
        "tag":"Hair",
        "patterns":["I am balding",
                    "my beard is patchy",
                    "my hairline is receding",
                    "I am insecure about my facial hair",
                    "I hate how my facial hair looks",
                    "I wish I could grow a fuller beard",
                    "I wish I could grow a fuller moustache",
                    "I feel self-conscious about my patchy facial hair",
                    "I think my facial hair makes me look unkempt",
                    "I envy those who can grow a thick, well-groomed beard/mustache",
                    "I want to grow fuller facial hair",
                    "I want to have a clean beard",
                    "I want to have a better looking beard",
                    "I want to have good looking hair",
                    "I want to have a good looking beard",
                    "I want a better hairline",
                    "I hate my hair. It never looks good",
                    "I wish I had thicker/longer hair",
                    "I'm embarrassed by my hair's thinness/baldness",
                    "I want to have better hair",
                    "I want to have thicker looking hair"],
        "responses":["Hair Intent"],
        "followup":[
                     "Do you use Shampoo in your hair once a week?",
                     "Do you use conditioner in your hair once a week?",
                     "Do you use a Dermaroller for your beard twice a week?",
                     "Do you eat lots of fruits and vegetables?",
                     "Do you cleanse your skin every day?",
                     "Do you avoid alcohol and smoking consumption?"]
      },
      {
        "tag":"Body",
        "patterns":["my face looks fat",
                    "I feel like my body looks weird",
                    "I feel really fat",
                    "I can't tell if I am fat",
                    "Am I fat",
                    "I'm really skinny",
                    "I'm really fat",
                    "My hips are really wide",
                    "My arms are really small",
                    "My arms are really big",
                    "My legs are really small",
                    "My legs are too big",
                    "My belly fat won't go away even though I am skinny everywhere else",
                    "My face is fat but I'm skinny in every other place",
                    "Why does my face look weird",
                    "Why is my nose weird?",
                    "Why are my ears weird?",
                    "Why is my mouth weird?",
                    "I want to look more aesthetic",
                    "I want to have nice body",
                    "I want a better body"
                    ],
        "responses":["Body intent"],
        "followup":["Can you do anything about insecurities that you have?",
                    "Do you ensure the highest possible reps*sets*weight for all aesthetic muscles in the gym throughout the week?",
                    "Do you do face workouts to tone face shape as best possible?"]
      }
    ]
}